2019/regular-expressions-in-different-environments.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-03-11 周一 21:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>不同环境下的正则表达式</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">不同环境下的正则表达式</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org64fa179">1. 前言</a></li>
<li><a href="#org7487ac0">2. PCRE</a></li>
<li><a href="#orgc471b45">3. POSIX</a></li>
<li><a href="#org08360a3">4. 原始字符串</a></li>
<li><a href="#org2d09d1e">5. 结语</a></li>
<li><a href="#org362373c">6. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org64fa179" class="outline-2">
<h2 id="org64fa179"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
距离初次接触正则表达式已经过了很久了，随着使用环境的增多，才发现，正则表达式不止一种。
</p>

<p>
当初学习的正则表达式能够在大多数地方使用，但是，偶尔还是会在一些地方碰壁。
</p>

<p>
经过一番研究后，发现另外两种正则表达式也并没有多么复杂，因此，就在这里总结一下。
</p>
</div>
</div>

<div id="outline-container-org7487ac0" class="outline-2">
<h2 id="org7487ac0"><span class="section-number-2">2</span> PCRE</h2>
<div class="outline-text-2" id="text-2">
<p>
PCER 的全称是 Perl Compatible Regular Expression，即：Perl 兼容的正则表达式。
</p>

<p>
这应该是目前使用得最广泛的一种正则表达式，我们平时使用的就是这种正则表达式，
各种编程语言如 Java、Python、C#、JavaScript 实现的就是这种正则表达式。
</p>

<p>
在 Python 正则表达式库的官方文档中我们也可以在开头开到这样一句明确的描述：
</p>
<blockquote>
<p>
This module provides regular expression matching operations similar to those found in Perl.
</p>
</blockquote>

<p>
对于这种正则表达式的使用，这里就不做过多的称述了，相关的文档与教程网上很多，也可以参考我以前的博客 <a href="https://rgb-24bit.github.io/blog/2018/regex.html">正则表达式</a>。
</p>
</div>
</div>

<div id="outline-container-orgc471b45" class="outline-2">
<h2 id="orgc471b45"><span class="section-number-2">3</span> POSIX</h2>
<div class="outline-text-2" id="text-3">
<p>
在 <code>Unix/Linux</code> 环境下，常常会通过命令行进行各种 <b>匹配</b> 操作，常用的两种匹配方式就是通过 <b>Glob</b> 和 <b>正则表达式</b>.
</p>

<p>
和 Unix/Linux 的文件系统一样，Unix/Linux 环境下的正则表达式也存在一套 <b>POSXI</b> 规范，在这套规范下的正则表达式可以分为 BRE(Basic Regular Expression, 基本型正则表达式) 和
ERE(Extended Regular Express, 扩展型正则表达式) 两种。
</p>

<p>
这两种正则表达式使用起来感觉没有 <b>PCRE</b> 用起来舒服，同时还容易混淆，但是，由于经常在命令行环境下工作的原因，感觉还是有必要掌握这两种正则表达式。
</p>

<p>
这两种正则表达式其实并不复杂，只是在部分元字符上具有不同的含义罢了，以下是这些元字符在不同环境下的表现形式：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">PCRE</th>
<th scope="col" class="org-left">BRE</th>
<th scope="col" class="org-left">ERE</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>(</code></td>
<td class="org-left"><code>\(</code></td>
<td class="org-left"><code>(</code></td>
<td class="org-left">定义子表达式的开始</td>
</tr>

<tr>
<td class="org-left"><code>)</code></td>
<td class="org-left"><code>\)</code></td>
<td class="org-left"><code>)</code></td>
<td class="org-left">定义子表达式的结束</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left"><code>\+</code></td>
<td class="org-left"><code>+</code></td>
<td class="org-left">匹配前一个字符(子表达式)的一次或多次重复</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left"><code>\?</code></td>
<td class="org-left"><code>?</code></td>
<td class="org-left">匹配前一个字符(子表达式)的零次或一次重复</td>
</tr>

<tr>
<td class="org-left"><code>\vert</code></td>
<td class="org-left"><code>\\vert</code></td>
<td class="org-left"><code>\vert</code></td>
<td class="org-left">匹配前面的或后面的元素</td>
</tr>

<tr>
<td class="org-left"><code>{</code></td>
<td class="org-left"><code>\{</code></td>
<td class="org-left"><code>{</code></td>
<td class="org-left">略</td>
</tr>

<tr>
<td class="org-left"><code>}</code></td>
<td class="org-left"><code>\}</code></td>
<td class="org-left"><code>}</code></td>
<td class="org-left">略</td>
</tr>
</tbody>
</table>

<p>
可以看到，主要的问题就出现在元字符 <code>(</code>, <code>)</code>, <code>+</code>, <code>?</code>, <code>|</code>, <code>{</code> 和 <code>}</code> 上，其中，ERE 的表现形式和 PCRE 是一致的，而 BRE 的表现形式就略显奇怪。
</p>

<p>
在 BRE 环境下，如果要匹配字符串 <code>abc</code> 一次或多次的话就要写成 <code>\(abc\)\+</code>, 和我们一般的书写方式 <code>(abc)+</code> 差别不小。
</p>

<p>
当然，这样做的好处还是有的，比如说需要匹配大量的这几个元字符的使用，用 BRE 就不需要疯狂转义了，比如匹配 <code>(){}+?</code>, 用 <code>PCRE/ERE</code> 就需要写成 <code>\(\)\{\}\+\?</code>.
</p>

<p>
另外，还需要明白的是，在这 <b>BRE</b> 和 <b>ERE</b> 环境中，是不存在诸如 <code>\d</code>, <code>\s</code> 的特殊元字符的，就算有，那也应该是那个工具提供的额外扩展。
</p>

<p>
因此，要在 <b>BRE</b> 和 <b>ERE</b> 环境中匹配某类字符，要么使用 <b>字符集合</b> 要么使用 <b>POSIX</b> 字符类：
</p>
<ul class="org-ul">
<li>字符集合通过中括号 <code>[]</code> 进行定义，如 <code>[1-9]</code></li>
<li><p>
<b>POSIX</b> 字符类可以参加下表：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">字符类</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>[:alnum:]</code></td>
<td class="org-left">任何一个字母或数字</td>
</tr>

<tr>
<td class="org-left"><code>[:alpha:]</code></td>
<td class="org-left">任何一个字母</td>
</tr>

<tr>
<td class="org-left"><code>[:blank:]</code></td>
<td class="org-left">空格或制表符</td>
</tr>

<tr>
<td class="org-left"><code>[:cntrl:]</code></td>
<td class="org-left">ASCII 控制字符(ASCII 0-31, 127)</td>
</tr>

<tr>
<td class="org-left"><code>[:digit:]</code></td>
<td class="org-left">任何一个数字</td>
</tr>

<tr>
<td class="org-left"><code>[:graph:]</code></td>
<td class="org-left">和 <code>[:print:]</code> 一样, 但不包括空格</td>
</tr>

<tr>
<td class="org-left"><code>[:lower:]</code></td>
<td class="org-left">任何一个小写字母</td>
</tr>

<tr>
<td class="org-left"><code>[:print:]</code></td>
<td class="org-left">任何一个可打印字符</td>
</tr>

<tr>
<td class="org-left"><code>[:punct:]</code></td>
<td class="org-left">既不属于 <code>[:alnum:]</code> 也不属于 <code>[:cntrl:]</code> 的任何一个字符</td>
</tr>

<tr>
<td class="org-left"><code>[:space:]</code></td>
<td class="org-left">任何一个空白字符, 包括空格</td>
</tr>

<tr>
<td class="org-left"><code>[:upper:]</code></td>
<td class="org-left">任何一个大写字符</td>
</tr>

<tr>
<td class="org-left"><code>[:xdigit:]</code></td>
<td class="org-left">任何一个十六进制数字</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org08360a3" class="outline-2">
<h2 id="org08360a3"><span class="section-number-2">4</span> 原始字符串</h2>
<div class="outline-text-2" id="text-4">
<p>
这是除了正则表达式的类型以外另一个会影响正则表达式的使用的因素。
</p>

<p>
对于一般的字符串来说，假如字符串中存在字符 <code>\</code>, 那么紧跟在字符 <code>\</code> 后面的字符将会被转义。在正则表达式中，我们经常会用到字符 <code>\</code> 本身，
因此我们就需要用 <code>\\</code> 来代替 <code>\</code>.
</p>

<p>
而在原始字符串环境中，字符串的原始形式和字符串的实际形式是相同的，也就是不会发生转义，这样一来，我们就可以直接将正则表达式写为 <code>\d+</code> 而不是写成 <code>\\d+</code>.
</p>

<p>
这我目前接触过的一些编程语言中，像 Python、C#、JavaScript 是支持原始字符串的，同时，还有一种环境也是属于原始字符串的，那就是 <b>命令行</b> 环境。
</p>

<p>
当我们将命令行参数传递给程序时，传递给程序的参数形式就是字符串的原始形式。
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span>* <span class="org-variable-name">argv</span>[]) {
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 1; i &lt; argc; ++i) {
    printf(<span class="org-string">"%s\n"</span>, argv[i]);
  }
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
比如说，执行以上的代码可以得到的输出：
</p>
<div class="org-src-container">
<pre class="src src-bash">$ prog \n
\n
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d09d1e" class="outline-2">
<h2 id="org2d09d1e"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
所以说，我们平时说的正则表达式应该是原始字符串环境下的 PCRE，然后就是在需要转义的字符串环境下 PCRE。
</p>

<p>
再然后就是一些 <b>古老</b> 的工具使用的 BRE 和 ERE 了，比如 sed、awk、emacs……
</p>

<p>
啊，为什么先诞生的正则表达式不是 PCRE……
</p>
</div>
</div>

<div id="outline-container-org362373c" class="outline-2">
<h2 id="org362373c"><span class="section-number-2">6</span> 参考链接</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="http://www.4e00.com/blog/linux/2016/01/21/posix-bre-and-ere-regular-expression.html">posix 正则表达式规范 bre 和 ere 简介</a></li>
<li><a href="https://www.gnu.org/software/findutils/manual/html_node/find_html/Regular-Expressions.html#Regular-Expressions">Regular Expressions - Finding Files</a></li>
<li><a href="https://en.wikibooks.org/wiki/Regular_Expressions/POSIX-Extended_Regular_Expressions">Regular Expressions/POSIX-Extended Regular Expressions - Wikibooks, open books for an open world</a></li>
<li><a href="https://zh.wikipedia.org/wiki/%E6%AD%A3%E5%88%99%E8%A1%A8%E8%BE%BE%E5%BC%8F">正则表达式 - 维基百科，自由的百科全书</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
